[
  {
    "title": "Better Technology",
    "content": "Don’t get stuck behind the curve with an outdated “Stack”.  Our experts live on the cutting edge to ensure your technology is custom fit to your business while delivering superior performance, higher security, lower cost, and a better scaling."
  },
  {
    "title": "Deep Experience",
    "content": "Our portfolio speaks for itself. Our senior alpha professionals have the know-how can tackle even the largest, most complex projects."
  },
  {
    "title": "100% Accountability",
    "content": "We remove the risk from your project by guaranteeing on-time, on-budget delivery. Regardless of the obstacles, we will ensure we deliver on the project timeline and to your expectations."
  },
  {
    "title": "We Speak Business Results",
    "content": "Leverage our 15+ years of startup, Fortune 500, and business know-how to ensure your project meets the most demanding technical and business requirements in your market."
  },
  {
    "title": "White Glove Treatment",
    "content": "We treat each engagement like royalty.   We hand-select your team based on skills, industry experience, availability, etc. and the provides certified project managers to oversee engagement."
  },
  {
    "title": "Full “Agile Scrum”",
    "content": "Not just great developers, but we also offer full scrum teams that include alpha UI/UX designers, business analysts, QA, developers, db admins, and certified scrum masters."
  },
  {
    "title": "100% Accountability ",
    "content": "We remove the risk from your project by guaranteeing on-time, on-budget delivery. Regardless of the obstacles, we will ensure we deliver on the project timeline and to your expectations. "
  },
  {
    "title": "Rock-Solid Guarantee",
    "content": "Every contract includes guarantee clauses to ensure that we complete your project on time and on budget. You will also get a 6-month warranty obliging us to fix major and critical defects discovered upon project completion."
  },
  {
    "title": "IPR Protection",
    "content": "We take your intellectual property rights very seriously. To make sure your ideas stay yours, we sign a strict NDA from day one to secure your exclusive ownership of the codebase and other deliverables."
  },
  {
    "title": "White Glove Treatment",
    "content": "We treat each engagement like royalty.   We hand-select your team based on skills, industry experience, availability, etc. and the provides certified project managers to oversee engagement."
  }
]